//Напишите программу, которая на вход принимает число и выдаёт, 
//является ли число чётным (делится ли оно на два без остатка).

//4 -> да
//-3 -> нет
//7 -> нет
int a = int.Parse(Console.ReadLine());
int b = int.Parse(Console.ReadLine());
int c = int.Parse(Console.ReadLine());
if(a%2==0){

    Console.WriteLine("Да");

}else Console.WriteLine("Нет");

if(b%2==0){

    Console.WriteLine("Да");

}else Console.WriteLine("Нет");

if(c%2==0){

    Console.WriteLine("Да");

}else Console.WriteLine("Нет");